Revit 2027 API
ParameterFilterRuleFactory.CreateLessOrEqualRule(ElementId, String) Method
 Creates a filter rule that determines whether strings from the document are less than or equal to a certain value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FilterRule CreateLessOrEqualRule(
	ElementId parameter,
	string value
)
Public Shared Function CreateLessOrEqualRule (
	parameter As ElementId,
	value As String
) As FilterRule
public:
static FilterRule^ CreateLessOrEqualRule(
	ElementId^ parameter,
	String^ value
)
static member CreateLessOrEqualRule :
        parameter : ElementId *
        value : string -> FilterRule
Parameters
parameter ElementId
 A string-typed parameter used to get values from the document for a given element.
value String
 The user-supplied string value against which values from the document will be compared.
Return Value
FilterRule
 Created filter rule object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 For strings, a value is "less" than another if it would appear before the other in an alphabetically-sorted list.
See Also
Reference
ParameterFilterRuleFactory Class
CreateLessOrEqualRule Overload
Autodesk.Revit.DB Namespace